# FInLayer

## Description
Function FInLayer returns a handle to the first object within the referenced layer. If the layer is empty, the function returns NIL.&lt;BR&gt;

```pascal
FUNCTION FInLayer(h : HANDLE) : HANDLE;
```

```python

def vs.FInLayer(h):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to layer.|

## Version
Availability: from MiniCAD
## Category
* Document List Handling